posts/2017-10-12-the-burden-of-freedom.org
#+title: The Burden of Freedom
#+filetags: prayer religion
#+date: <2017-10-12>

Hearing the sermon on Sunday, then reading Abraham Joshua Heschel on Monday and Flannery O'Connor on Tuesday – they all seemed to be speaking the same thing to me. This week's prayer:

Lord,

I feel the weight of my choices,\\
bearing down upon my conscience,\\
each one a testimony to the truth\\
that those who do evil\\
have their greatest allies\\
in those who do nothing.

The burden of freedom is this,\\
though only some are guilty,\\
we are all surely responsible.

We ask not that this burden\\
be taken from us, but instead,\\
that we bear it with more\\
than the empty thoughts and prayers\\
of those who just pass by,\\
but with the grace and love\\
of the Samaritan\\
that leads to action.

/Amen/


