docs/posts/2017-10-12-the-burden-of-freedom.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 28, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>The Burden of Freedom</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">The Burden of Freedom</h1>
<p class="subtitle" role="doc-subtitle">Oct 12, 2017</p>
</header><p>
Hearing the sermon on Sunday, then reading Abraham Joshua Heschel on Monday and Flannery O&rsquo;Connor on Tuesday – they all seemed to be speaking the same thing to me. This week&rsquo;s prayer:
</p>

<p>
Lord,
</p>

<p>
I feel the weight of my choices,<br>
bearing down upon my conscience,<br>
each one a testimony to the truth<br>
that those who do evil<br>
have their greatest allies<br>
in those who do nothing.
</p>

<p>
The burden of freedom is this,<br>
though only some are guilty,<br>
we are all surely responsible.
</p>

<p>
We ask not that this burden<br>
be taken from us, but instead,<br>
that we bear it with more<br>
than the empty thoughts and prayers<br>
of those who just pass by,<br>
but with the grace and love<br>
of the Samaritan<br>
that leads to action.
</p>

<p>
<i>Amen</i>
</p>




<div class="tagline" id="orgb8a77c5">
<p>
Tagged: <a href="../tags/prayer.html">Prayer</a> <a href="../tags/religion.html">Religion</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 28, 2024.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
